# System
cask "wine-stable" # needs rosetta2

# TODO enforce rosetta2 installation in Makefile?
# TODO setup test MacOS VM? (in container?)

# Appearance
cask "jordanbaird-ice" # menu bar replacement
cask "stats" # system monitoring widgets

# Browsers
cask "eloston-chromium" # fallback & website testing browser
cask "firefox" # main browser

# Secrets
brew "gnupg" # GPG client
brew "pinentry-mac" # for having GNUPG ask passphrases in a GUI
cask "keepassxc" # password manager

# Terminal/Shell
brew "antidote" # zsh plugin manager
brew "starship" # shell prompt
brew "zsh" # shell
cask "font-fira-code-nerd-font" # patched font for terminal
cask "wezterm" # terminal emulator

# Dev Tools
brew "git" # version control
brew "libpq" # needed for dbeaver to dump/restore pgsql db
brew "neovim" # TUI text editor
brew "volta" # node version manager
cask "bruno" # postman alternative
cask "dbeaver-community" # database client
cask "fork" # GUI git client
cask "rancher" # for docker CLI
cask "visual-studio-code" # GUI text editor

# Documentation/Notes Tools
brew "plantuml" # UML diagram generator (& more)
brew "structurizr-cli" # C4 model CLI tool
cask "drawio" # diagram editor
cask "obsidian" # personal notes

# Utilities
brew "bat" # enhanced cat, aliased in zsh cfg
brew "eza" # non retro-compatible ls alternative
brew "fzf" # fuzzy finder, used in zsh cfg
brew "riff" # enhanced diff, aliased in zsh cfg
brew "stow" # symlink manager, used by dotfiles
cask "hammerspoon" # macOS automation tool, used by dotfiles
