# System
cask "wine-stable" # needs rosetta2

# TODO enforce rosetta2 installation in Makefile?
# TODO setup test MacOS VM? (in container?)

# Appearance
cask "jordanbaird-ice" # menu bar replacement
cask "stats" # system monitoring widgets

# Audio
cask "deezer" # music streaming service
cask "eqmac"  # system-wide equalizer, conflict with background-music
# TODO deep dive into the blackhole-2ch + camilladsp solution instead of eqmac

# Browsers
cask "firefox" # main browser
cask "ungoogled-chromium" # fallback & website testing browser

# Secrets
brew "gnupg" # GPG client
brew "pinentry-mac" # for having GNUPG ask passphrases in a GUI
cask "keepassxc" # password manager

# Terminal/Shell
brew "antidote" # zsh plugin manager
brew "starship" # shell prompt
brew "zsh" # shell
cask "font-fira-code-nerd-font" # patched font for terminal
cask "wezterm" # terminal emulator

# Docker
brew "dive" # docker tool for analyzing and optimizing images
cask "rancher" # for docker CLI

# Other Dev Tools
brew "git" # version control
brew "libpq" # needed for dbeaver to dump/restore pgsql db
brew "mise" # universal version manager for multiple languages (asdf alternative)
brew "neovim" # TUI text editor
cask "bruno" # postman alternative
cask "dbeaver-community" # database client
cask "fork" # GUI git client
cask "jetbrains-toolbox" # JetBrains IDE manager
cask "visual-studio-code" # GUI text editor

# Documentation/Notes Tools
cask "drawio" # diagram editor
cask "obsidian" # personal notes

# Utilities
brew "bat" # enhanced cat, aliased in zsh cfg
brew "eza" # non retro-compatible ls/tree alternative, used in zsh cfg
brew "fzf" # fuzzy finder, used in zsh cfg
brew "riff" # enhanced diff, aliased in zsh cfg
brew "stow" # symlink manager, used by dotfiles
cask "hammerspoon" # macOS automation tool, used by dotfiles
